{"nombre":"pagina","descripcion":"Crea una página dentro de un Formulario. Por defecto la página define un Form que contendrá todos los elementos de la página.","parametros":[{"nombre":"_[name]_","keyword":"name","tipo":"requerido","descripcion":"Identificador de la página."},{"nombre":"noForm","keyword":"noForm","tipo":"opcional","descripcion":"No se crea el Form por defecto, permite definir manualmente Forms dentro de la página."},{"nombre":"noAutenticar","keyword":"noAutenticar","tipo":"opcional","descripcion":"Los usuarios no registrados pueden acceder a la página."},{"nombre":"guardarParaPreparar","keyword":"guardarParaPreparar","tipo":"opcional","descripcion":"Guarda en base de datos si la página fue guardada, sirve para comprobar que todas las páginas fueron guardadas antes de presentar la solicitud."},{"nombre":"permiso \u003d _[permiso]_","keyword":"permiso","tipo":"opcional","descripcion":"Nombre del permiso asociado a la página."},{"nombre":"campo \u003d _[campo]_","keyword":"campo","tipo":"opcional","descripcion":"Define la entidad que se puede usar en los campos que se sitúen dentro de la página. Si no se especifica este parámetro, ni en el formulario que contiene a la página, entonces no se crearán los botones asociados a cada una de las acciones."},{"nombre":"inicial","keyword":"inicial","tipo":"opcional","descripcion":"Establece esta página como la inicial de la aplicación."},{"nombre":"titulo \u003d _[string]_","keyword":"titulo","tipo":"opcional","descripcion":"Define un título para la página."},{"nombre":"mensajeFinal","keyword":"mensajeFinal","tipo":"opcional","descripcion":"En el caso que se quiera configurar un mensaje personalizado para la página y se especifique esta opción, se indicará que se quiere poner el mensaje al final de la página. Por defecto, se colocará al principio de la página."},{"nombre":"perteneceA \u003d _[string]_","keyword":"perteneceA","tipo":"opcional","descripcion":"En el caso de que se quiera agrupar las páginas por módulos, permite indicar a qué módulo pertenece la página. Si se emplea, se dependerá de una property que debe definirse en el @application.conf@ de la aplicacion de la siguiente manera: _fap.modulo.nombreModulo_. Esta property regula el acceso a las páginas del módulo correspondiente, si está igualada a true, las páginas son accesibles, si está igualada a false o no existe, no se podrá acceder."}]}