{"nombre":"subirArchivo","descripcion":"Elemento para la subida de archivos al servidor de la aplicación.","parametros":[{"nombre":"_[name]_","keyword":"name","tipo":"requerido","descripcion":"Identificador del elemento."},{"nombre":"campo","keyword":"campo","tipo":"requerido","descripcion":"Campo de tipo documento donde se almacenará el documento que quiere subirse."},{"nombre":"requerido","keyword":"requerido","tipo":"opcional","descripcion":"Indica la obligatoriedad de la subida de un archivo"},{"nombre":"tramite","keyword":"tramite","tipo":"opcional","descripcion":"Sirve para filtrar los documentos, por el tipo de trámite, que se pueden subir."},{"nombre":"aportadoPor","keyword":"aportadoPor","tipo":"opcional","descripcion":"Sirve para filtrar los documentos, que se pueden subir, por el tipo de persona que lo puede hacer (Por ejemplo puede haber ocasiones en que un determinado tipo de documento lo deba subir el Ciudadano y otro tipo especifico debe ser aportado por la Administración)."},{"nombre":"mimes","keyword":"mimes","tipo":"opcional","descripcion":"Para especificar el tipo de documentos que se pueden subir controlando el tipo MIME. Si especificamos este elemento, no se puede poner junto a la propiedad siguiente \u003ca href\u003d\"http://fap-devel.etsii.ull.es/home/documentacion/http\"\u003eextensiones\". Por ejemplo, si sólo queremos dejar que se puedan subir en nuestro elemento archivos PDF, tendremos que darle el valor \"application/pdf\". Se pueden especificar más tipos separándolos por comas. Para más información acerca de los MIMES de cada documento \"Tipos de Mimes\u003c/a\u003e://www.htmlquick.com/es/reference/mime-types.html"},{"nombre":"extensiones","keyword":"extensiones","tipo":"opcional","descripcion":"Para especificar el tipo de documentos que se pueden subir controlando la extensión del archivo. Si especificamos este elemento, no se puede poner junto a la propiedad anterior \"mimes\". Por ejemplo, si sólo queremos dejar que se puedan subir en nuestro elemento archivos PDF, tendremos que darle el valor \"pdf\". Se pueden especificar más tipos separándolos por comas."},{"nombre":"listarDocumentosSubidos","keyword":"listarDocumentosSubidos","tipo":"opcional","descripcion":"Si ponemos el parámetro \"listarDocumentosSubidos\" al definir un elemento SubirArchivo en nuestro fichero fap nos permite elegir un documento ya subido al gestor documental para no volver a subirlo. Cuando elegimos un tipo de documento en la lista desplegable, aparece una tabla con los documentos de ese tipo ya subidos (sólo los documentos en los que es solicitante el usuario que ha iniciado sesión)."}]}